[DIALOG_102]
BUTTON_1001=TestFile
BUTTON_1004=StartTest
BUTTON_1006=Save Result
BUTTON_1009=AutoTest
DIALOG_TITLE=Rockchip DDR Test Tool for User
LABEL_1007=
LABEL_1008=

[Prompt]
ERROR_ACTION_RUN=Action is running now,please exit later!
INFO_NOFOUNDDEVICE=No found any devices
INFO_FOUNDMANYDEVICE=Found many devices
INFO_FOUNDONEDEVICE=Found one device
ERROR_INITIALIZE_FAIL=Stopping to run the action,because of failure of initialization!
INFO_TESTDDR_OK=Testing DDR Success.
INFO_TESTDDR_FAIL=Testing DDR failed!
ERROR_CHECK_TESTFILE=Checking DDR test file failed!
ERROR_NO_DEVICE=No found any devices,stop to test DDR!
ERROR_MANY_DEVICE=Found many devices,stop to test DDR!
ERROR_GET_DEVICE=Getting property of device failed,stop to test DDR!
ERROR_NOT_SUPPORT_DEVICE=Current device is not available,stop to test DDR!
INFO_DOWNLOADBOOT_START=Start to download boot...
ERROR_DOWNLOADBOOT_FAIL=Download boot failed!
INFO_DOWNLOADBOOT_OK=Download boot ok
INFO_DOWNLOADITEM_START=Start to download test item %s...
ERROR_DOWNLOADITEM_FAIL=Download test item failed!
INFO_DOWNLOADITEMPARAM_START=Start to download parameter of %s
ERROR_DOWNLOADITEMPARAM_FAIL=Download parameter of test item failed!
INFO_RUNITEM_START=Start to run test item %s
ERROR_RUNITEM_FAIL=Running test item failed!
INFO_RUNITEM_OK=Running test item %s ok
INFO_SAVE_TESTRESULT_OK=Saving result of ddr test ok.
INFO_SAVE_TESTRESULT_FAIL=Saving result of ddr test failed!
ERROR_RESET_MASKROM=Switch to Maskrom failed!
ERROR_WAIT_MASKROM=Waiting for Maskrom failed!
TEXT_SELECT_DEVICE_DIALOG_TITLE=Select test device
TEXT_DEVICE_LIST_STATIC=List of device:
TEXT_REFRESH_DEVICE_BUTTON=Refresh
TEXT_OK_BUTTON=OK
TEXT_CANCEL_BUTTON=Cancel
TEXT_TEST_DEVICE=Device: